In [3]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\rishika\anaconda3\lib\site-packages (0.9.3)

In [4]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\rishika\anaconda3\lib\site-packages (1.2.15)

In [74]:
import sqlalchemy as db
import pymysql

In [75]:
from sqlalchemy import create_engine

In [76]:
import pandas as pd

In [79]:
engine = create_engine('mysql+pymysql://foouser:F88Pa%%**@134.209.144.239/stocksdb')

In [80]:
query = "select * from interview"
df = pd.read_sql_query(query,engine)

In [81]:
df.head(5)

,isin,insertion_datetime,datetime,open,high,low,close,volume,open_interest
0,INE545A01016,NaT,2018-01-01 09:15:00,2419.0,2436.00,2408.90,2435.25,10281,NaN
1,INE545A01016,NaT,2018-01-01 09:16:00,2435.0,2440.00,2426.45,2439.00,13315,NaN
2,INE545A01016,NaT,2018-01-01 09:17:00,2439.7,2439.70,2422.10,2424.95,3760,NaN
3,INE545A01016,NaT,2018-01-01 09:18:00,2420.0,2424.50,2386.50,2395.00,11653,NaN
4,INE545A01016,NaT,2018-01-01 09:19:00,2395.0,2413.95,2394.70,2409.85,7744,NaN

In [82]:
df.shape

(500000, 9)

In [83]:
df=pd.get_dummies(df)

In [84]:
df.head()

,insertion_datetime,datetime,open,high,low,close,volume,open_interest,isin_INE221B01012,isin_INE265F01028,isin_INE492A01029,isin_INE545A01016,isin_dummy1611,isin_dummy3751,isin_dummy3811
0,NaT,2018-01-01 09:15:00,2419.0,2436.00,2408.90,2435.25,10281,NaN,0,0,0,1,0,0,0
1,NaT,2018-01-01 09:16:00,2435.0,2440.00,2426.45,2439.00,13315,NaN,0,0,0,1,0,0,0
2,NaT,2018-01-01 09:17:00,2439.7,2439.70,2422.10,2424.95,3760,NaN,0,0,0,1,0,0,0
3,NaT,2018-01-01 09:18:00,2420.0,2424.50,2386.50,2395.00,11653,NaN,0,0,0,1,0,0,0
4,NaT,2018-01-01 09:19:00,2395.0,2413.95,2394.70,2409.85,7744,NaN,0,0,0,1,0,0,0

In [101]:

import datetime as dt
df['datetime'] = pd.to_datetime(df.datetime,format='%Y-%m-%d')
df['datetime']=df['datetime'].map(dt.datetime.toordinal)

df.index = df['datetime']

data = df.sort_index(ascending=True, axis=0)

In [102]:
data.head()

,insertion_datetime,datetime,open,high,low,close,volume,open_interest,isin_INE221B01012,isin_INE265F01028,isin_INE492A01029,isin_INE545A01016,isin_dummy1611,isin_dummy3751,isin_dummy3811
datetime,,,,,,,,,,,,,,,
736422,NaT,736422,2765.3,2765.3,2765.3,2765.3,0,NaN,1,0,0,0,0,0,0
736422,NaT,736422,720.0,720.0,720.0,720.0,0,NaN,0,0,1,0,0,0,0
736422,NaT,736422,720.0,721.0,720.0,721.0,154,NaN,0,0,1,0,0,0,0
736422,NaT,736422,721.0,721.0,721.0,721.0,0,NaN,0,0,1,0,0,0,0
736422,NaT,736422,721.0,721.0,721.0,721.0,0,NaN,0,0,1,0,0,0,0

In [120]:
pd.isna(data['open_interest'])

datetime
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
736422     True
          ...
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
737059    False
Name: open_interest, Length: 500000, dtype: bool

In [112]:


train = data[0:30000]
test = data[30000:]

In [121]:
x_train = train.drop('close',axis=1)
x_train = train.drop('insertion_datetime',axis=1)

In [122]:
y_train = train['close']

In [139]:
x_test = test.drop('close',axis=1)
x_test= test.drop('insertion_datetime',axis=1)

In [140]:
test_p = test['close']

In [141]:
x_train.fillna(0,inplace=True)

In [142]:
x_test.fillna(0,inplace=True)

In [126]:
x_train.head()

,datetime,open,high,low,close,volume,open_interest,isin_INE221B01012,isin_INE265F01028,isin_INE492A01029,isin_INE545A01016,isin_dummy1611,isin_dummy3751,isin_dummy3811
datetime,,,,,,,,,,,,,,
736422,736422,2765.3,2765.3,2765.3,2765.3,0,0.0,1,0,0,0,0,0,0
736422,736422,720.0,720.0,720.0,720.0,0,0.0,0,0,1,0,0,0,0
736422,736422,720.0,721.0,720.0,721.0,154,0.0,0,0,1,0,0,0,0
736422,736422,721.0,721.0,721.0,721.0,0,0.0,0,0,1,0,0,0,0
736422,736422,721.0,721.0,721.0,721.0,0,0.0,0,0,1,0,0,0,0

In [143]:
#implement linear regression
from sklearn.linear_model import LinearRegression

In [144]:
model = LinearRegression()
model.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [145]:
pred=model.predict(x_test)

In [146]:
model.score(x_test,true_p)

-1.3189888344669694

In [148]:
model.score(x_train,y_train)

1.0